import csv
with open('spaceships.csv', 'w', encoding='UTF8', newline = '') as f:
    writer = csv.writer(f)
    writer.writerow(['Название','Тип','Год запуска','Максимальная скорость(км/ч)','Страна производитель'])
    writer.writerow(['Аполлон','Лунный модуль', 1969, 39068,'США'])
    writer.writerow(['Союз-ТМ','Космический корабль', 2002, 28000,'Россия'])
    writer.writerow(['Фалькон','Ракета-носитель', 21010, 27700,'США'])
    writer.writerow(['Юнион','Космический корабль', 1999, 28000,'Россия'])
    writer.writerow(['Ариан','Ракета-носитель', 1996, 40721,'Европейский союз'])
    writer.writerow(['Шаттл','Космический корабль', 1984, 27480,'США'])
    writer.writerow(['Тяньгун','Космическая станция', 2011, 28000,'Китай'])
    writer.writerow(['Прогресс-М','Грузовой корабль', 2000, 28155,'Россия'])
    writer.writerow(['Гагарин','Космический корабль', 2018, 30000,'Россия'])
    writer.writerow(['Старшот','Межпланетная зондовая миссия', 2022, 72000,'США'])
    writer.writerow(['СпейсХоппер','Пилотируемый космический корабль',2020,28000,'США'])
    writer.writerow(['Альфа-Центавр-1','Межзвездный зонд',2030,200000,'Международный проект'])
    writer.writerow(['Сатурн-V','Ракета-носитель',1967,40190,'США'])
    writer.writerow(['Тианьшу-2','Космическая станция',2025,30000,'Китай'])
    writer.writerow(['Дракон','Грузовой космический корабль',2012,28000,'США'])
    writer.writerow(['Восток-1','Космический корабль',1961,27000,'СССР'])
    writer.writerow(['Протон-М','Ракета-носитель',2001,30800,'Россия'])
    writer.writerow(['Арес-1','Ракета-носитель',2030,37000,'США'])
    writer.writerow(['Сентинел','Космический телескоп',2022,65000,'Международный проект'])
    writer.writerow(['Пегас','Грузовой космический корабль',1988,28000,'США'])



with open('spaceships.csv', 'r', encoding='UTF8', newline='') as f:
    reader = csv.reader(f)
    for row in reader:
        print(row)
