#Ввод и вывод данных в консоль. Объекты. Числа
#Задание 1. Азы азов
x = float(input("Введите первое число x: "))
y = float(input("Введите второе число y: "))
print("Вывод данныx x + y = ", x + y)
