# Задание 5. Миссия выполнима
import math as m

x = float(input("Введите число: "))
h = m.ceil(x)
w = m.floor(x)
print(f"Высота вверх: {h},\nВысота вниз: {w}")
