#Задание 2. Простые арифметические вычисления
x = float(input("Введите первое число x: "))
y = float(input("Введите второе число y: "))
z = (x + y) * 3
print("Вывод данных (x + y) * 3 = ", "{:.2f}".format(z))# Напишите здесь свой код :-)
