# Задача 4. Счетчик счастливых чисел Тома

x = int(input('Введите первое число: '))
y = int(input('Введите второе число: '))


while True:
    n = (y - x) / 77
    print(round(n))
    break

