# Задача 2. Счетчик бракованных батончиков

count = 0
bad_count = 0

while True:
    candy_bar = int(input('Введите вес батончика в граммах: '))

    else:
        n = bad_count / (count + bad_count)
        print(f'{n:.2f}')
        break




